others/log/gtd.org
#+OPTIONS: ^:{} _:{} num:nil toc:nil \n:t
#+INCLUDE: "template/gtd.org"
#+SETUPFILE: "../../layout/extension.org"
#+title:

* C++ [0/5]
  - [ ] C++11 http://blog.csdn.net/lanphaday/article/details/6564162 
  - [ ] C++ String http://blogs.360.cn/blog/linux-gcc-stl-string-in-depth/
  - [ ] C++11 - the new ISO C++ standard http://www.stroustrup.com/C++11FAQ.html
  - [ ] what's ODR http://www.cnblogs.com/winter-cn/archive/2009/11/17/1604867.html
* Java [1/7]
   - [ ] guava
   - [ ] 继承图
   - [ ] java工厂
   - [ ] java jar
   - [ ] java注解
   - [ ] static class
   - [X] junit

* Hadoop [2/3]
  - [X] 总结DistributedCache
  - [X] hadoop测试单元
    - [X] Mockito http://liuzhijun.iteye.com/blog/1512780
    - [X] MRUnit http://www.alidata.org/archives/657
          http://www.infoq.com/articles/HadoopMRUnit
  - [ ] 《Hadoop权威指南》P145 MiniDFSCluster MiniMRCluster
    http://www.lopakalogic.com/articles/hadoop-articles/hadoop-testing-with-minicluster/

