others/log/gtd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title></title>
<!-- 2014-06-07 星期六 20:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../layout/css/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../layout/css/style.css" />
<script src="../../layout/js/jquery_1.7.1.js"></script>
<script src="../../layout/js/bootstrap_old.js"></script>
<link rel="stylesheet" type="text/css" href="template/gtd.css" />

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">C++ <code>[0/5]</code></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><code>[&#xa0;]</code> C++11 <a href="http://blog.csdn.net/lanphaday/article/details/6564162">http://blog.csdn.net/lanphaday/article/details/6564162</a> <br/>
</li>
<li><code>[&#xa0;]</code> C++ String <a href="http://blogs.360.cn/blog/linux-gcc-stl-string-in-depth/">http://blogs.360.cn/blog/linux-gcc-stl-string-in-depth/</a><br/>
</li>
<li><code>[&#xa0;]</code> C++11 - the new ISO C++ standard <a href="http://www.stroustrup.com/C++11FAQ.html">http://www.stroustrup.com/C++11FAQ.html</a><br/>
</li>
<li><code>[&#xa0;]</code> what's ODR <a href="http://www.cnblogs.com/winter-cn/archive/2009/11/17/1604867.html">http://www.cnblogs.com/winter-cn/archive/2009/11/17/1604867.html</a><br/>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Java <code>[1/7]</code></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> guava<br/>
</li>
<li><code>[&#xa0;]</code> 继承图<br/>
</li>
<li><code>[&#xa0;]</code> java工厂<br/>
</li>
<li><code>[&#xa0;]</code> java jar<br/>
</li>
<li><code>[&#xa0;]</code> java注解<br/>
</li>
<li><code>[&#xa0;]</code> static class<br/>
</li>
<li><code>[X]</code> junit<br/>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Hadoop <code>[2/3]</code></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>[X]</code> 总结DistributedCache<br/>
</li>
<li><code>[X]</code> hadoop测试单元<br/>
<ul class="org-ul">
<li><code>[X]</code> Mockito <a href="http://liuzhijun.iteye.com/blog/1512780">http://liuzhijun.iteye.com/blog/1512780</a><br/>
</li>
<li><code>[X]</code> MRUnit <a href="http://www.alidata.org/archives/657">http://www.alidata.org/archives/657</a><br/>
          <a href="http://www.infoq.com/articles/HadoopMRUnit">http://www.infoq.com/articles/HadoopMRUnit</a><br/>
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> 《Hadoop权威指南》P145 MiniDFSCluster MiniMRCluster<br/>
    <a href="http://www.lopakalogic.com/articles/hadoop-articles/hadoop-testing-with-minicluster/">http://www.lopakalogic.com/articles/hadoop-articles/hadoop-testing-with-minicluster/</a><br/>
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
